<br><br><center><h1 style="font-size:2em;color:#2467C0">Tagesaufgaben 05.04.2023</h1></center>
<br>

<div  class="alert alert-block alert-info">
1. Du hast einen Dataframe mit Schülernoten zu verschiedenen Fächern vorliegen. Benutze pivot, um folgenden Output zu erhalten:

    Output:
    Fach       Deutsch  Englisch  Mathematik
    Name
    Alexander      1.3       1.7         1.0
    Anna           1.0       1.7         1.3
    Lisa           2.3       3.0         2.7
    Max            1.7       2.3         2.0
</div>

In [22]:
import pandas as pd

noten_df = pd.DataFrame({
    "Name": ["Max", "Max", "Max", "Anna", "Anna", "Anna", "Lisa", "Lisa", "Lisa", "Alexander", "Alexander", "Alexander"],
    "Fach": ["Mathematik", "Deutsch", "Englisch","Mathematik", "Deutsch", "Englisch","Mathematik", "Deutsch", "Englisch","Mathematik", "Deutsch", "Englisch"],
    "Note": [2.0, 1.7, 2.3, 1.3, 1.0, 1.7, 2.7, 2.3, 3.0, 1.0, 1.3, 1.7]

})
noten_df

         Name        Fach  Note
0         Max  Mathematik   2.0
1         Max     Deutsch   1.7
2         Max    Englisch   2.3
3        Anna  Mathematik   1.3
4        Anna     Deutsch   1.0
5        Anna    Englisch   1.7
6        Lisa  Mathematik   2.7
7        Lisa     Deutsch   2.3
8        Lisa    Englisch   3.0
9   Alexander  Mathematik   1.0
10  Alexander     Deutsch   1.3
11  Alexander    Englisch   1.7

In [23]:
noten_df.pivot(index=["Name"],columns="Fach",values=["Note"])

             Note
Fach      Deutsch Englisch Mathematik
Name
Alexander     1.3      1.7        1.0
Anna          1.0      1.7        1.3
Lisa          2.3      3.0        2.7
Max           1.7      2.3        2.0

<div  class="alert alert-block alert-info">
2. Dir liegt ein Dataframe mit Tech-Produkten vor. Du möchtest diesen ins Long-Format überführen. Nutze dafür melt, um folgenden Output zu erhalten:

    Output:
              Land      Produkt  Verkaufszahl
    0      Deutschland  MacBook          1200
    1              USA  MacBook          2000
    2            Japan  MacBook           800
    3   Großbritannien  MacBook          1000
    4      Deutschland   Lenovo          1500
    5              USA   Lenovo          1800
    6            Japan   Lenovo           900
    7   Großbritannien   Lenovo          1200
    8      Deutschland     Dell           800
    9              USA     Dell          1200
    10           Japan     Dell           700
    11  Großbritannien     Dell           600

</div>

In [2]:
tech = {
    'Land': ['Deutschland', 'USA', 'Japan', 'Großbritannien'],
    'MacBook': [1200, 2000, 800, 1000],
    'Lenovo': [1500, 1800, 900, 1200],
    'Dell': [800, 1200, 700, 600]
}
tech_df = pd.DataFrame(tech)
tech_df

             Land  MacBook  Lenovo  Dell
0     Deutschland     1200    1500   800
1             USA     2000    1800  1200
2           Japan      800     900   700
3  Großbritannien     1000    1200   600

In [4]:
tech_df.melt(id_vars="Land",var_name="Produkt",value_name="Verkaufszahl")

              Land  Produkt  Verkaufszahl
0      Deutschland  MacBook          1200
1              USA  MacBook          2000
2            Japan  MacBook           800
3   Großbritannien  MacBook          1000
4      Deutschland   Lenovo          1500
5              USA   Lenovo          1800
6            Japan   Lenovo           900
7   Großbritannien   Lenovo          1200
8      Deutschland     Dell           800
9              USA     Dell          1200
10           Japan     Dell           700
11  Großbritannien     Dell           600

<div  class="alert alert-block alert-info">
3. Dir liegt ein Dataframe mit weiteren Tech-Produkten vor. Dein Output soll so aussehen:

    Output:
    Quartal                  Q1
    Land        Produkt
    Deutschland Adapter     700
                Maus        800
                Tastatur   1000
                USB-Stick   900
    Japan       Adapter     700
                Maus        900
                Tastatur    800
                USB-Stick  1000
    USA         Adapter    1000
                Maus       1200
                Tastatur   2000
                USB-Stick  1500
<div  class="alert alert-block alert-info">
Wie gehst du vor?

</div>

In [20]:
data = {
    'Land': ['USA', 'USA', 'USA', 'USA', 'Deutschland', 'Deutschland', 'Deutschland', 'Deutschland', 'Japan','Japan', 'Japan', 'Japan'],
    'Produkt': ['USB-Stick', 'Tastatur', 'Maus', 'Adapter', 'USB-Stick', 'Tastatur', 'Maus', 'Adapter', 'USB-Stick', 'Tastatur', 'Maus', 'Adapter'],
    'Quartal': ['Q1', 'Q2', 'Q3', 'Q4', 'Q1', 'Q1', 'Q1', 'Q1', 'Q1', 'Q1', 'Q1', 'Q1'],
    'Verkaufszahl': [1500, 2000, 1200, 1000, 900, 1000, 800, 700, 1000, 800, 900, 700]
}
df = pd.DataFrame(data)

print(df)

           Land    Produkt Quartal  Verkaufszahl
0           USA  USB-Stick      Q1          1500
1           USA   Tastatur      Q2          2000
2           USA       Maus      Q3          1200
3           USA    Adapter      Q4          1000
4   Deutschland  USB-Stick      Q1           900
5   Deutschland   Tastatur      Q1          1000
6   Deutschland       Maus      Q1           800
7   Deutschland    Adapter      Q1           700
8         Japan  USB-Stick      Q1          1000
9         Japan   Tastatur      Q1           800
10        Japan       Maus      Q1           900
11        Japan    Adapter      Q1           700

In [21]:
df.pivot(index=["Land","Produkt"],columns="Quartal",values=["Verkaufszahl"])

                      Verkaufszahl
Quartal                         Q1      Q2      Q3      Q4
Land        Produkt
Deutschland Adapter          700.0     NaN     NaN     NaN
            Maus             800.0     NaN     NaN     NaN
            Tastatur        1000.0     NaN     NaN     NaN
            USB-Stick        900.0     NaN     NaN     NaN
Japan       Adapter          700.0     NaN     NaN     NaN
            Maus             900.0     NaN     NaN     NaN
            Tastatur         800.0     NaN     NaN     NaN
            USB-Stick       1000.0     NaN     NaN     NaN
USA         Adapter            NaN     NaN     NaN  1000.0
            Maus               NaN     NaN  1200.0     NaN
            Tastatur           NaN  2000.0     NaN     NaN
            USB-Stick       1500.0     NaN     NaN     NaN

<div  class="alert alert-block alert-info">
4. Lade den Titanic-Datensatz (titanic.csv) als titanic_df und lass dir a) die oberen sieben Zeilen ausgeben und b) die zehn unteren.
</div>

<div  class="alert alert-block alert-info">
4. Verwende die Methode describe(). Was zeigt sie dir an? Was aus der Ausgabe lässt sich sinnvoll interpretieren und welche Information ist unnütz? Kommentiere.
</div>

<div  class="alert alert-block alert-info">
5. Du möchtest alle Daten zu folgender Person: Celotti, Mr. Francesco. Wie stellst du das an?
</div>

<div  class="alert alert-block alert-info">
6. Du möchtest einen Slice des DataFrames, der nur Passagiere der ersten Klasse enthält. Erreiche das durch Slicing mit einer Bedingung und schreibe das Ergebnis in die Variabel erste_klasse. Lasse dir den head von dieser ausgeben und miss ihre Länge.
</div>

<div  class="alert alert-block alert-info">
7. Diesmal möchtest du zwei Slices des DataFrames: Leute die überlebt haben und Leute, die gestorben sind. Überlebende haben in der Spalte Survived den Wert 1. Die, die nicht überlebt haben, weisen eine 0 auf. Erstelle zwei Dataframes aus den Slices: ueberlebende und tote. Lass dir auch hier die Länge ausgeben. Errechne das Verhältnis von Überlebenden zu Toten. Wenn du Lust hast: Rechne den Wert in Prozent um und runde auf zwei Nachkommastellen.
</div>

<div  class="alert alert-block alert-info">
8. Du möchtest einen Teil des DataFrames ueberlebende auswählen. Und zwar willst du nur Name, Geschlecht und Alter darin sehen. Wie stellst du das an? Schreibe das Resultat in ueberlebende_kompakt und lasse dir den Inhalt ausgeben.
</div>

<div  class="alert alert-block alert-info">
9. Speichere ueberlebende_kompakt in ueberlebende_passagiere.csv